Autodesk.Revit.DB.Structure.BentFabricStraightWiresLocation
Bent Fabric straight wires location.
The side on wich straight wires will be loacted is determined by the start and end point of the first bent profile segment that specifies the direction of the curve loop on plane.
Since:
2017
Since:
2017

Autodesk.Revit.DB.Structure.BentFabricStraightWiresLocation.Left
Fabric straight wires are located on the left side of bent wires.

Autodesk.Revit.DB.Structure.BentFabricStraightWiresLocation.Right
Fabric straight wires are located on the right side of bent wires.